Autodesk.AutoCAD.Colors.Color.GetColorValue(System.Int16,System.Drawing.Color)
Converts an AutoCAD Color Index (ACI) value to System.Drawing.Color taking the current background color into account.
colorIndex:  Input short integer as ACI color to convert
backgroundColor:  Input background color