Autodesk.AutoCAD.DatabaseServices.Database.DbFromId(System.Int64)
Looks up a runtime ID in a map and returns the associated Database object.
id: Input integer that represents the runtime ID of the Database to return

Autodesk.AutoCAD.DatabaseServices.Database.IdFromDb(Autodesk.AutoCAD.DatabaseServices.Database)
Looks up a database in a map and returns its runtime ID.
dataBase: Input Database of which to get its runtime ID