Autodesk.AutoCAD.Runtime.RuntimeSystem.Main(System.IntPtr,System.Int32)
Initializes the .NET Runtime using ICLRRuntimeHost.
arg: Input System.IntPtr; argument is not used, it's there to satisfy ExecuteInDefaultAppDomain which calls the method and loads the acdbmgd assembly.
argLength: Input length of arg