Autodesk.AutoCAD.DatabaseServices.TypedValue.ToString(System.String,System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider, displayed with a specific format.
format: Input format to display
provider: Input System.IFormatProvider object