GeomapType.NoMap
No map

GeomapType.Aerial
Map in aerial view

GeomapType.Road
Map in road view

GeomapType.Hybrid
Map in hybrid view

GeomapType.EsriImagery
Esri Map in imagery view

GeomapType.EsriOpenStreetMap
Esri Map in OpenStreet view

GeomapType.EsriStreets
Esri Map in OpenStreet (streets) view

GeomapType.EsriLightGray
Esri Map in OpenStreet (Light Gray Canvas) view

GeomapType.EsriDarkGray
Esri Map in OpenStreet (Dark Gray Canvas) view