Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.SetShapeIsUprightAt(System.Int32,System.Boolean)
Sets the UprightAt bit for the shape (or text string) at position index in the LinetypeTableRecord. If isUprightAt is True, then the bit is set and the shape will orient itself relative to the line it's embedded within. If isUprightAt is False, then the shape will orient itself relative to the current UCS if isUcsOriented is True.
index must be greater than or equal to zero, but less than the value returned from NumDashes. index is a zero-based index (shapes and text strings have the same index as the dash that precedes them in the linetype definition) with the first dash in the linetype being index 0.
For more information on linetype definitions and embedded shapes, see the "Linetypes" section of the AutoCAD Customization Guide.
index: Input index (0-based) of shape (or text string) to get
isUpright: Input bool to control how the shape is to orient itself

Autodesk.AutoCAD.DatabaseServices.LinetypeTableRecord.ShapeIsUprightAt(System.Int32)
Gets the value of the UprightAt bit for the shape (or text string) set at position index in the LinetypeTableRecord.
index: Input index (0-based) of shape (or text string) to get