Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureEnabled(System.UInt64)
Returns a Boolean indicating whether a hardware feature is enabled.
feature: Input input feature

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureAvailable(System.UInt64)
Returns a Boolean indicating whether a feature is available.
feature: Input input feature

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureRecommended(System.UInt64)
Returns the hardware feature recommended status.
feature: Input hardware feature to query

Autodesk.AutoCAD.GraphicsSystem.Configuration.SetFeatureEnabled(System.UInt64,System.Boolean)
Enables or disables a particular hardware feature.
feature: Input feature to be enabled
enable: Input Boolean to enable or disable the feature

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureUsedVal(System.UInt64)
Get the value of the hardware feature.
feature: Input feature name as string

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureAvailableVal(System.UInt64)
Get the available value for the hardware feature.
A_0: Input feature name as string

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureRecommendedVal(System.UInt64)
Get the recommended value for the hardware feature.
feature: Input feature name as string

Autodesk.AutoCAD.GraphicsSystem.Configuration.SetFeatureUsedVal(System.UInt64,System.Int32)
Set the value of the hardware feature.