Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.addRequirement(ulong)
Require support for a given capability. Effectively the same as addSupport but used for different documentary purposes.
A_0: String describing the graphics capability

Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.supports(ulong)
Query support for a given capability. Effectively the same as requires but used for different documentary purposes.
A_0: String describing the graphics capability

Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.Drawing2D
This capability indicates that the kernel supports fast 2D drawing (e.g., Whip).

Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.Drawing3D
This capability indicates that the kernel supports "legacy" 3D drawing.

Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.Drawing3D2
This capability indicates that the kernel supports 3D drawing.

Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.RapidRTRendering3D
This capability indicates that the kernel supports Rapid RT rendering.

Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.Selection3D
This capability indicates that the kernel supports 3D selection of objects.